{"sections":{"main":{"type":"page-about-us","disabled":true,"settings":{}},"f538a340-bf07-44d6-bd5f-daf735cdd8ac":{"type":"image-with-text-2","blocks":{"61f84a8e-b6e5-43de-8ec9-d9aa116d8fa8":{"type":"Button","settings":{"custom_button_text":"MY ACCOUNT","custom_button_link":"https:\/\/cloud9linens.com\/account\/login?return_url=%2Faccount","my_button_style":"sf__btn-secondary"}},"b77ddc79-627d-4d27-ae79-e6dede66ab7b":{"type":"Button","settings":{"custom_button_text":"SHIPPING & RETUENS","custom_button_link":"shopify:\/\/pages\/customer-care-shipping-returns-policy","my_button_style":"sf__btn-secondary"}},"c7c46031-da20-4032-ab47-38d460c1ec74":{"type":"Button","settings":{"custom_button_text":"ORDER STATUS","custom_button_link":"shopify:\/\/pages\/customer-care-check-order-status","my_button_style":"sf__btn-secondary"}},"c0e78059-3099-4a11-8dc0-746b7465bee6":{"type":"Button","settings":{"custom_button_text":"FAQ","custom_button_link":"shopify:\/\/pages\/customer-care-frequently-asked-questions","my_button_style":"sf__btn-secondary"}}},"block_order":["61f84a8e-b6e5-43de-8ec9-d9aa116d8fa8","b77ddc79-627d-4d27-ae79-e6dede66ab7b","c7c46031-da20-4032-ab47-38d460c1ec74","c0e78059-3099-4a11-8dc0-746b7465bee6"],"custom_css":["h3 {color: #ffffff;}","h1 {color: #ffffff;}"],"settings":{"sec-hide-show":true,"my_custum_btn_setting":true,"container":"w-full","hero_size":"medium","show_overlay":true,"image":"shopify:\/\/shop_images\/sun-setting-over-ocean.jpg","bg_position":"center","image_link":"","parallax":false,"content_in_container":false,"content_position":"center middle","text_alignment":"center","text_size":"large","text_color":"white","title":"<h1><b>SHIPPING & RETURNS<\/b><\/h1>","font_size":18,"subtitle":"","text":"","para_font_size":21,"button_label":"","button_link":"","button_style":"sf__btn-primary","button_size":"","custom_class":"sec_font_size cus_size_chart","mob_content":true}},"rich_text_9wWtpU":{"type":"Rich-text","settings":{"rich-heading":"","richtext-prt":"","custom-class":""}},"rich_text_eG6fRD":{"type":"Rich-text","settings":{"rich-heading":"<h2><b>SHIPPING & RETURNS<\/b><\/h2>","richtext-prt":"<br><p><\/p><div style=\"text-align:left;\">\n<h4 class=\"about__block-heading\">At Cloud9linens, we aim to deliver your orders promptly and efficiently.<\/h4>\n<br>\n<p><\/p>\n<h4><b>Shipping Methods<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>We offer the following shipping methods: - Standard Shipping: 3- 5 working days - Express Shipping: 1 -  3 working days - International Shipping: Maximum of 10 days.\n<\/h4>\n<br>\n<p><\/p>\n<h4><b>Shipping Costs<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>Shipping costs are calculated based on the weight of your order and the delivery location. Shipping charges will be displayed at checkout.<\/h4>\n<br>\n<p><\/p>\n<h4><b>Processing Time<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>Orders are processed within 3 business days. You will receive a confirmation email once your order has shipped.<\/h4>\n<br>\n<p><\/p>\n<h4><b>Tracking<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>A tracking number will be provided once your order is shipped. You can track your order using the provided link<b> click here.<\/b>\n<\/h4>\n<br>\n<p><\/p>\n<h4><b>Delay<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>We are not responsible for shipping delays caused by factors beyond our control, such as weather conditions, customs delays, or carrier issues.Delivery charges are based on the total weight of the order. At this time we are unable to ship to P.O. or A.P.O boxes. Our shipping carrier UPS will make a rst attempt, then redirect the package to the nearest UPS Access Point if the rst attempt was unsuccessful. Please visit UPS.com for more information on UPS Access Points.*International shipping charges are not inclusive of any duties, tax or broker fees that may apply and for which the recipient of the shipment will be responsible. Please be advised that, effective March 26, 2020, UPS has suspended the UPS Service Guarantee for all shipments to any destination, at all service levels. For this reason, Cloud9linens has removed all expedited shipping methods from our website until further notice. With regards to processing and lead times, we are currently shipping orders as normal, with increased employee safety measures in place.<\/h4>\n<br>\n<p><\/p>\n<h4><b>Signature Required Delivery<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>YOrders above $3000, unless placed with an express payment method, will require a signature upon delivery.Orders below $3000 have the option of delivery with or without signature required. By selecting delivery without signature required, the purchaser conrms that the parcel can be left outside the premises of the address provided and the purchaser will take responsibility for any loss or damage that may occur. Orders placed with an express payment method (eg. Paypal and Apple Pay from Product Page or Shopping Bag Page) are shipped without signature upon delivery. By placing an order with an express payment method, the purchaser conrms that the parcel can be left outside the premises of the address provided and the purchaser will take responsibility for any loss or damage that may occur.<\/h4>\n<br>\n<p><\/p>\n<h4><b>Online Returns and Exchange Policy<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>For items eligible for return, please <b><a href=\"mailto:customer_assistance@cloud9linens.com\">customer_assistance@cloud9linens.com<\/a><\/b>\nor <b>contact us<\/b> page with your cloud9linens.com United States, Africa, Middle East & Europe order number and indicate the returning item(s) to request a RMA number.If the purchase is eligible for return, Customer Service will issue a RMA number and a complimentary prepaid UPS return shipping label. If you choose to use a direct shipping method, please ensure tracking is available on the shipment and note that we are unable to reimburse any fees charged for shipping or insurance. Cloud9linens.com cannot be held responsible for any items that are lost, stolen or damaged during shipping and will not refund the value of the goods. All return shipping charges must be prepaid. COD returns will not be accepted.Please enclose the items in their original packaging with any hangtags attached, accompanied by the packing slip and RMA number. Write the RMA on the exterior of the returning package, seal the box securely, and ax the return shipping label.All shipments without a RMA number issued by Cloud9linens.com will be refused at delivery and returned to sender.Within 20 days of receiving your return product, credit will be returned to the original form of payment. Gift returns will also be credited to the original form of payment within 20 days of our receipt of your returned product.International Returns to cloud9linens.com see service areas and region pages to return to the most convenient address to you.United StatesEuropeAfricaMiddle EastInternational returns of full-priced items are accepted within 30 days of receipt of shipment. All shipping and handling charges and duties and taxes are non-refundable. Returning shipping costs and duties & taxes will be deducted from the total refund amount.For items eligible for return, please <b><a href=\"mailto:customer_assistance@cloud9linens.com\">customer_assistance@cloud9linens.com<\/a><\/b> or <b>contact us<\/b> page with your cloud9linens.com. Order number and indicate the returning item(s) to request a RMA number.If the purchase is eligible for return, Customer Service will issue a RMA number and a prepaid UPS return shipping label. *International returns must be shipped using the prepaid UPS return shipping label.* International returns without a RMA number issued by Cloud9linens.com or shipped using a shipping method other than the prepaid UPS return shipping label issued by cloud9linens.com not be accepted and will be returned to sender. cloud9linens.com is not responsible for any shipments sent using a shipping method other than the prepaid UPS return shipping label issued by cloud9linens.com.Please enclose the items in their original packaging with any hangtags attached, accompanied by the packing slip and RMA number. Write the RMA on the exterior of the returning package, seal the box securely, and ax the return shipping label.All shipments without a RMA number issued by cloud9linens.com will be refused at delivery and returned to sender.Within 20 days of receiving your return product, credit will be returned to the original form of payment. Gift returns will also be credited to the original form of payment within 20 days of our receipt of your returned product.For inquiries regarding purchases made on cloud9linens.com United States, Europe, Middle East and Africa please contact <b><a href=\"mailto:customer_assistance@cloud9linens.com\">customer_assistance@cloud9linens.com<\/a><\/b>\n<\/h4>\n<br>\n<p><\/p>\n<h4><b>Price Adjustments<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>For any full-priced merchandise purchased online, cloud9linens.com United states,Africa, Europe or Middle East offers a one-time price adjustment within 7 days of purchase. No adjustments can be made on already discounted merchandise, discounted items are final & not refundable. Contact <b><a href=\"mailto:customer_assistance@cloud9linens.com\">customer_assistance@cloud9linens.com<\/a><\/b> visit contact us page with your order number and item details.<\/h4>\n<br>\n<p><\/p>\n<h4><b>Exchange<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>Cloud9linens.com currently cannot accept exchanges. For an exchange, the original items must be returned and a new order should then be placed.<\/h4>\n<p><\/p>\n<br>\n<h4><b>Retail Stores & Exchange Policy<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>Items purchased at Cloud9linens Retail Stores partner can be returned for exchange or merchandise credit to be used at cloud9linens Retail Stores only. Items must be returned unused in original packaging with hangtags attached within 14 days from the date of purchase or the date of shipment accompanied by the original packing slip.<\/h4>\n<p><\/p>\n<br>\n<h4><b>Final Sale & Seasonal Deals<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<h4>ALL SALE ITEMS ARE FINAL SALE. A one-time price adjustment can be made on any full-priced merchandise within 7 days of purchase. No adjustments can be made on already discounted items. All shipping and handling charges are non-refundable.<\/h4>\n<p><\/p>\n<br>\n<h4><b>Cloud9linens LLC<\/b><\/h4>\n<br>\n<p>\n<\/p>\n<\/div>","custom-class":""}},"e16c3aa8-617d-48bf-8e99-a5c3276005d0":{"type":"custom-content","settings":{"heading":"","subheading":"","description":"","column_size":50,"header_alignment":"center","container":"container-fluid","background_color":"","gap":30,"wd_container":true,"custom_padding_bottom":16,"use_scroll_mobile":false,"gap_mobile":16,"custom_class":""}}},"order":["main","f538a340-bf07-44d6-bd5f-daf735cdd8ac","rich_text_9wWtpU","rich_text_eG6fRD","e16c3aa8-617d-48bf-8e99-a5c3276005d0"]}